// 質問項目
const questions = [
    {
        category: '全般の質問',
        questions: [
            {
                question: '工学院ハッカソンとは？',
                answer: '工学院大学の学生のためのハッカソンです．工学院大学内にハッカソンの魅力を伝えると同時に，多くの人にものづくりの楽しさを知ってもらうために開催しています．'
            },
            {
                question: '対象学生．参加条件を教えてください',
                answer: '工学院大学の学生であればどなたでもご参加いただけます．大学・大学院，学部・学科は問いません．学外の学生については現在募集しておりませんが，いずれ広く募集したいと考えております．'
            },
            {
                question: '参加費はかかりますか？',
                answer: 'かかりません．無料でご参加いただけます．'
            },
            {
                question: '賞金はありますか？',
                answer: '年間総額で50万円の予算いただいております！各賞金の詳細は各イベントのページをご覧ください．'
            },
            {
                question: 'すべての日程に参加しなければなりませんか？',
                answer: '原則全日参加をお願いしていますが，どうしても難しい場合は運営にご相談ください．'
            },
            {
                question: '初心者でも参加できますか？',
                answer: 'もちろんです！初心者大歓迎です！初心者の方のために講習会も用意しています．'
            },
            {
                question: '参加人数は制限されていますか？',
                answer: '制限はありません．'
            },
            {
                question: '参加するにはどうしたらよいですか？',
                answer: '各イベントページに参加方法を記載しております．ご確認ください．'
            },
        ]
    },
    {
        category: '開発について',
        questions : [
            {
                question: '開発方法に指定はありますか？',
                answer: '特に指定はありません．各チームで自由に決めてください'
            },
            {
                question: 'プログラミングのスキルは必須ですか？',
                answer: '必須ではありません．基本的にはFigmaというデザインツールを使ってプロトタイプを作成することが目標のため，プログラミングの知識・スキルは必要ありません．'
            },
        ]

    },
    {
        category: '当日について',
        questions: [
            {
                question: '当日必要なものはありますか？',
                answer: 'パソコンや機材，プレゼンテーションの資料など，開発・発表に必要なものをお持ちください．オンラインの場合は安定した通信環境をご用意ください．'
            },
            {
                question: 'どんな服で参加すればいいですか？',
                answer: '特に指定はありません．楽な格好でご参加ください．'
            },
            {
                question: '食事は提供されますか？',
                answer: 'イベントによっては提供されることもございます．詳しくは各イベントページをご確認ください．'
            },
            {
                question: '休憩はありますか？',
                answer: '運営が適宜休憩時間を設けます．'
            },
            {
                question: '遅刻する場合はどうしたらよいですか？',
                answer: 'Discordやメール等で運営までご連絡ください．'
            }
        ]
    }

];

export default questions;